{"meta":{"title":"lselyの博客","subtitle":"勤勤恳恳写代码，慵慵懒懒摆摆烂","description":"前进！不择手段的前进！","author":"lsely","url":"http://example.com","root":"/"},"pages":[{"title":"关于我","date":"2022-12-11T07:57:34.000Z","updated":"2022-12-12T07:24:26.503Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"你进来干什么？ 想了解一下我？好吧. 博客所有者资料 性别：男 年龄：■2 体重：■5 kg 身高：1■5 cm 主力语言：C++,Java,平时写应用之类的就用这俩货;也会Python,但主要用来爬好康的。 身份：程序员 * 学生 爱好：写应用和打游戏"},{"title":"Flag","date":"2022-12-12T02:18:54.000Z","updated":"2022-12-12T07:16:48.768Z","comments":true,"path":"flag/index.html","permalink":"http://example.com/flag/index.html","excerpt":"","text":"1. 写完TBOX++ 2. 学习鸿蒙开发 3. 继续完善博客 4. 写完《Java-GUI程序开发》 5. 写一篇《Github Page+Hexo静态博客搭建教程》"},{"title":"分类","date":"2022-12-11T08:00:45.000Z","updated":"2022-12-12T00:37:20.440Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2022-12-11T07:59:51.000Z","updated":"2022-12-12T00:42:09.986Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""},{"title":"百科","date":"2022-12-13T00:52:12.000Z","updated":"2022-12-13T06:19:37.880Z","comments":true,"path":"wiki/index.html","permalink":"http://example.com/wiki/index.html","excerpt":"","text":"此页面所有信息于百度百科爬取，不进行商用活动，主要用于个人查找参考。 知名网站 哔哩哔哩哔哩哔哩（，英文名称：bilibili，简称B站，是中国年轻世代高度聚集的文化社区和视频网站，该网站于2009年6月26日创建，被网友们亲切地称为“B站”[1-2] 。2018年3月28日，哔哩哔哩在美国纳斯达克上市 。2021年3月29日，哔哩哔哩正式在香港二次上市[180] 。B站早期是一个ACG（动画、漫画、游戏）内容创作与分享的视频网站。[5-6] 经过十年多的发展，围绕用户、创作者和内容，构建了一个源源不断产生优质内容的生态系统，B站已经涵盖7000多个兴趣圈层的多元文化社区，曾获得QuestMobile研究院评选的“Z世代偏爱APP”和“Z世代偏爱泛娱乐APP”两项榜单第一名并入选“BrandZ”报告2019最具价值中国品牌100强] 。2022年2月，哔哩哔哩直播将上线开播前人脸认证功能，确保开播人与实名认证者一致，后续逐步在各个分区开放 。9月29日，港交所官网显示，哔哩哔哩在香港联交所由第二上市转为主要上市，将于10月3日正式生效。 百度百度（Baidu）是拥有强大互联网基础的领先AI公司。百度愿景是：成为最懂用户，并能帮助人们成长的全球顶级高科技公司。[1] “百度”二字，来自于八百年前南宋词人辛弃疾的一句词：众里寻他千百度。这句话描述了词人对理想的执着追求。1999年底，身在美国硅谷的李彦宏看到了中国互联网及中文搜索引擎服务的巨大发展潜力，抱着技术改变世界的梦想，他毅然辞掉硅谷的高薪工作，携搜索引擎专利技术，于 2000年1月1日在中关村创建了百度公司。百度拥有数万名研发工程师，这是中国乃至全球都顶尖的技术团队。这支队伍掌握着世界上最为先进的搜索引擎技术，使百度成为中国掌握世界尖端科学核心技术的中国高科技企业，也使中国成为美国、俄罗斯和韩国之外，全球仅有的4个拥有搜索引擎核心技术的国家之一。[1] GitHubGitHub是一个面向开源及私有软件项目的托管平台，因为只支持Git作为唯一的版本库格式进行托管，故名GitHub。2022年4月13日起，GitHub 开始封锁受美国制裁公司的俄罗斯开发者账户。[7] CSDN中国专业IT社区CSDN (Chinese Software Developer Network) 创立于1999年，致力于为中国软件开发者提供知识传播、在线学习、职业发展等全生命周期服务。旗下拥有：专业的中文IT技术社区： CSDN.NET；移动端开发者专属APP： CSDN APP、CSDN学院APP；新媒体矩阵微信公众号：CSDN资讯、程序人生、GitChat、CSDN学院、AI科技大本营、区块链大本营、CSDN云计算、GitChat精品课、人工智能头条、CSDN企业招聘；IT技术培训学习平台： CSDN学院；技术知识移动社区： GitChat；IT人力资源服务：科锐福克斯；高校IT技术学习成长平台：高校俱乐部。[1] 知乎知乎，是一个中文互联网高质量的问答社区和创作者聚集的原创内容平台，于2011年1月正式上线，以“让人们更好地分享知识、经验和见解，找到自己的解答”为品牌使命。[1] 知乎凭借认真、专业、友善的社区氛围、独特的产品机制以及结构化和易获得的优质内容，聚集了中文互联网科技、商业、影视、时尚、文化领域最具创造力的人群，已成为综合性、全品类、在诸多领域具有关键影响力的知识分享社区和创作者聚集的原创内容平台，建立起了以社区驱动的内容变现商业模式。[1] 知乎，2017年11月8日入选时代影响力·中国商业案例TOP30。[2] 2019年10月21日，胡润研究院发布《2019胡润全球独角兽榜》，知乎排名第138位。[3] 6月6日原有的“知识市场”业务升级为“知乎大学”。[4] 7月，知乎完成新一轮融资，融资额接近3亿美元。[5] 2019年8月12日，知乎宣布完成F轮融资，总额4.34亿美元。[6] 截至2020年12月，知乎上的总问题数超过4400万条，总回答数超过2.4亿条。在付费内容领域，知乎月活跃付费用户数已超过250万，总内容数超过300万，年访问人次超过30亿。[7] 知乎以问答业务为基础，经过近十年的发展，已经承载为综合性内容平台，覆盖“问答”社区、全新会员服务体系“盐选会员”、机构号、热榜等一系列产品和服务，并建立了包括图文、音频、视频在内的多元媒介形式。[8] 2022年4月22日，知乎在港交所实现双重上市[45] 。 维基百科维基百科（英语：Wikipedia），总部位于美国，是一个基于维基技术的多语言百科全书式的协作计划，是用多种语言编写而成的网络百科全书。维基百科由非营利组织维基媒体基金会负责营运，维基百科接受捐赠。特点是自由内容、自由编辑。它是全球网络上最大且最受大众欢迎的参考工具书，名列全球十大最受欢迎的网站。Wikipedia是一个混成词，取自网站核心技术“wiki”和英文中百科全书之意的“encyclopedia”。吉米·威尔士与拉里·桑格两人的合作下于2001年1月13日在互联网上推出的网站服务是维基百科的前身。1月15日，正式展开网络百科全书计划。桑格提出新词“Wikipedia”。2018年12月，维基百科入围了2018世界品牌500强。[1] 2019年5月起，维基媒体基金会启动一项多年计划，着手于改进维基百科桌面版的用户界面，包括重新组织 logo、可折叠侧边栏、目录列表等[2] 。维基百科各个版本的条目之和已经超过5300万条，支持各种语言[2] ，其中中文维基百科有超过113万个条目。 百度百科百度百科是百度公司推出的一部内容开放、自由的网络百科全书。其测试版于2006年4月20日上线，正式版在2008年4月21日发布，截至2020年10月，百度百科已经收录了超2100万个词条，参与词条编辑的网友超过717万人，几乎涵盖了所有已知的知识领域。[1] “世界很复杂，百度更懂你”，百度百科旨在创造一个涵盖各领域知识的中文信息收集平台。百度百科强调用户的参与和奉献精神，充分调动互联网用户的力量，汇聚上亿用户的头脑智慧，积极进行交流和分享。同时，百度百科实现与百度搜索、百度知道的结合，从不同的层次上满足用户对信息的需求。 FacebookMeta公司（Meta Platform Inc，纳斯达克证券交易所代码：META），原名Facebook，创立于2004年2月4日，总部位于美国加利福尼亚州门洛帕克。[1] [144-145] 因脸书泄露5000万用户可能面临欧盟16.3亿美元罚款的威胁[7] 。2019年7月2日，德国向脸书开出200万欧元罚单[8] 。2021年6月，据市场消息：Facebook被欧盟、英国反垄断机构调查。[102] YouTubeYouTube是一个视频网站，早期公司位于美国加利福尼亚州的圣布鲁诺。注册于2005年2月15日，由美国华裔陈士骏等人创立，让用户下载、观看及分享影片或短片。2006年11月，Google公司以16.5亿美元收购了YouTube，并把其当做一家子公司来经营。但是对于如何通过YouTube盈利，Google一直保持非常谨慎的态度。被收购后的YouTube依然风靡全球网民，花旗银行分析师认为，以2012年整年计算，Google可能从YouTube获得24亿美元的净收入。2014年1月3日，YouTube宣布在拉斯维加斯消费电子展(CES)上演示4K高清视频流媒体服务。该服务采用谷歌的视频编解码技术VP9。网站的未注册用户仍可以直接观看视频，而注册用户则可以上传无限制数量的影片。而当影片有可能的冒犯性质的内容时，仅提供给18岁以上的注册用户观看。YouTube作为当前行业内在线视频服务提供商，YouTube的系统每天要处理上千万个视频片段，为全球成千上万的用户提供高水平的视频上传、分发、展示、浏览服务。2015年2月，央视首次把春晚推送到YouTube等境外网站。[1] Switch应用程序“Youtube”18年11月9日上架。[2] 2018年12月18日，世界品牌实验室编制的《2018世界品牌500强》揭晓，YouTube排名第20位。[3] 谷歌宣布，2019年5月30日关闭YouTube游戏频道，该平台上提供的大部分功能和内容被重新整合或并入到YouTube中。[4] 2019年10月，谷歌关闭了YouTube消息服务。[5] TiktokTikTok是字节跳动旗下短视频社交平台，于2017年5月上线[1] ，愿景是“激发创造，带来愉悦（ Inspire Creativity and Bring Joy）”。美国当地时间2020年8月24日，TikTok正式对特朗普8月6日颁布的第一道行政令提起诉讼，在新闻稿中称：”我们不会轻易起诉政府，但我们别无选择，只能采取行动来保护我们的权利，以及我们社区和员工的权利。” [2] 2020年9月14日，甲骨文证实，它已经与TikTok的中国所有者字节跳动达成协议，成为其“可信技术提供商”，但该协议仍需美国政府批准[3] ；9月18日，美商务部宣布9月20日起执行微信和TikTok禁令[4] ；9月27日，美国哥伦比亚特区联邦地区法院裁决，暂缓实施美国政府关于将TikTok从美国移动应用商店下架的行政命令[5] ；11月2日，TikTok宣布与索尼音乐娱乐公司达成协议[6] 。2021年2月10日，美国拜登政府要求联邦法院暂停抖音海外版TikTok禁令，以便重新审查这款移动应用程序对美国国家安全的威胁[7] ；3月12日，巴基斯坦宣布封锁TikTok[52] 。4月30日，字节跳动CFO周受资被任命兼任TikTok的首席执行官；Vanessa Pappas被任命为TikTok首席运营官[53] 。2021年6月9日，美国总统拜登撤销了特朗普政府对社交媒体应用TikTok和微信的禁令[55] 。2021年11月，TikTok扩张到电视领域，已在亚马逊Fire TV平台推出电视应用，TikTok将这一范围扩张到了三星、LG 以及 Android TV 电视平台。[58] 截至12月23日，TikTok是2021年世界上访问量最大的互联网网站。[60] 2022年8月，抖音及其海外版TikTok以将近6600万下载量。[73] 知名企业华为华为技术有限公司，成立于1987年，总部位于广东省深圳市龙岗区。[1] 2021年，华为公司的总收入为6368亿元，净利润达到1137亿元。[235] 华为是全球领先的信息与通信技术（ICT）解决方案供应商，专注于ICT领域，坚持稳健经营、持续创新、开放合作，在电信运营商、企业、终端和云计算等领域构筑了端到端的解决方案优势，为运营商客户、企业客户和消费者提供有竞争力的ICT解决方案、产品和服务，并致力于实现未来信息社会、构建更美好的全联接世界。2017年6月6日，《2017年BrandZ最具价值全球品牌100强》公布，华为名列第49位。2019年7月22日美国《财富》杂志发布了最新一期的世界500强名单 ，华为排名第61位。[2-3] 2018年《中国500最具价值品牌》华为居第六位。[4] 12月18日，《2018世界品牌500强》揭晓，华为排名第58位。[5] 2018年2月，沃达丰和华为完成首次5G通话测试[6] 。2019年8月9日，华为正式发布鸿蒙系统；[7] 8月22日，2019中国民营企业500强发布，华为投资控股有限公司以7212亿营收排名第一；[8] 12月15日，华为获得了首批“2019中国品牌强国盛典年度荣耀品牌的殊荣”。[9-10] 2022年8月3日，《财富》公布世界500强榜（企业名单），华为排在第96位。[11] 2020中国民营企业500强第一名。2020年11月17日，华为投资控股有限公司整体出售荣耀业务资产。对于交割后的荣耀，华为不占有任何股份，也不参与经营管理与决策。2022年上半年，华为实现销售收入3016亿元[252] 。 谷歌谷歌公司（Google Inc.）成立于1998年9月4日，由拉里·佩奇和谢尔盖·布林共同创建，被公认为全球最大的搜索引擎公司[1] 。谷歌是一家位于美国的跨国科技企业，业务包括互联网搜索、云计算、广告技术等，同时开发并提供大量基于互联网的产品与服务，其主要利润来自于关键词广告等服务。1999年下半年，谷歌网站“Google”正式启用[2] 。2010年3月23日，宣布关闭在中国大陆地区市场搜索服务。2015年8月10日，宣布对企业架构进行调整，并创办了一家名为Alphabet的“伞形公司”（Umbrella Company），成为Alphabet旗下子公司。2015年，在2015年度“世界品牌500强”排行中重返榜首，苹果公司和亚马逊分别位居第二和第三名。2016年6月8日，《2016年BrandZ全球最具价值品牌百强榜》公布，以2291.98亿美元的品牌价值重新超越苹果成为百强第一[3] 。2017年2月，Brand Finance发布2017年度全球500强品牌榜单，排名第一。2017年6月，《2017年BrandZ最具价值全球品牌100强》公布，谷歌公司名列第一位。2017年12月13日，谷歌正式宣布谷歌AI中国中心（Google AI China Center）在北京成立[4] 。2018年1月，腾讯和谷歌宣布双方签署一份覆盖多项产品和技术的专利交叉授权许可协议[5] 。2018年5月29日，《2018年BrandZ全球最具价值品牌100强》发布，谷歌公司名列第一位。12月18日，世界品牌实验室编制的《2018世界品牌500强》揭晓，Google排名第2位[6] 。2019年度全球最具价值100大品牌榜第二位[7] 。 intel英特尔是半导体行业和计算创新领域的全球领先厂商[17] ，创始于1968年。如今，英特尔正转型为一家以数据为中心的公司[18] 。英特尔与合作伙伴一起，推动人工智能、5G、智能边缘等转折性技术的创新和应用突破[32] ，驱动智能互联世界。2021年12月，英特尔声明：禁用新疆产品。[146] 就涉疆事件，英特尔中国回应“‘对中国深怀敬意’，对信件引发顾虑‘深表遗憾’”。[151] 2022年1月，英特尔CEO希望将芯片制造迁回本土[156] 2022年2月，英特尔设立10亿美元基金建立代工创新生态系统。[165] 2022年2月，在2022年投资者大会上，英特尔公布了产品和制程工艺技术路线图及重要节点。[170] 2022年4月6日报道，美国芯片巨头英特尔表示，已暂停所有在俄罗斯的业务。[177] 2022年10月，13代酷睿家族将会有50多款产品，有超过500多款机型都会采用13代酷睿处理器。[196] AMD美国AMD半导体公司专门为计算机、通信和消费电子行业设计和制造各种创新的微处理器（CPU、GPU、主板芯片组、电视卡芯片等），以及提供闪存和低功率处理器解决方案，公司成立于1969年。AMD致力为技术用户——从企业、政府机构到个人消费者——提供基于标准的、以客户为中心的解决方案。2006年7月24日，AMD宣布收购ATI，从此ATI成为了AMD的显卡部门。AMD提出3A平台的新标志，在笔记本领域有“AMD VISION”标志的就表示该电脑采用3A构建方案(CPU、GPU、主板芯片组均由AMD制造提供)。2018年12月，世界品牌实验室发布《2018世界品牌500强》榜单，amd排名第485。[1] 2020年10月27日 AMD 同意以股票交易的形式，按照 350 亿美元的价值收购 Xilinx（赛灵思），交易在2022年2月14日完成。[2] 为臻进战略终端市场和领先产品组合的演变，AMD于2022年推出了全新的品牌平台 “同超越，共成就 _”(“together we advance_”)，展示了AMD如何与其合作伙伴、客户和员工一起推进创新，并创建解决方案以应对各类极为严苛的挑战。[42] Qualcomm高通（英文名称：Qualcomm，中文简称：高通公司、美国高通或美国高通公司）创立于1985年，总部设于美国加利福尼亚州圣迭戈市，35,400多名员工遍布全球[1] 。高通是全球领先的无线科技创新者，变革了世界连接、计算和沟通的方式。把手机连接到互联网，高通的发明开启了移动互联时代[2] 。高通的基础科技赋能了整个移动生态系统，每一台3G、4G和5G智能手机中都有其发明[3] 。高通公司是全球3G、4G技术研发的领先企业，已经向全球多家制造商提供技术使用授权，涉及了世界上所有电信设备和消费电子设备的品牌。在中国，高通开展业务已逾20年，与中国生态伙伴的合作已拓展至智能手机、集成电路、物联网、大数据、软件、汽车等众多行业[4] 。公司股票是标准普尔100和500指数的成分股，在纳斯达克股票市场上的股票交易代码为QCOM。2018年12月，世界品牌实验室发布《2017世界品牌500强》榜单，高通排名第392[5] 。2019福布斯全球数字经济100强榜排名第32位[6] 。在《财富》2019“改变世界的公司”榜单中，高通因其对无线技术发展的巨大贡献和对5G的推动，位列第一[7] 。高通还被《快公司》（Fast Company）评选为“2020年全球最具创新力公司”[8] 。自2016年起，高通中国连续四年荣获“中国最受尊敬企业”称号，该项评选由《经济观察报》和北京大学联合主办，是体现企业运营、技术创新、社会责任及美誉度等多维度实力的权威奖项[9] 。 OracleOracle公司（甲骨文）是全球最大的信息管理软件及服务供应商，成立于1977年，总部位于美国加州Redwood shore，面向全球开放oracle认证。Oracle开发的关系数据库产品因性能卓越而闻名，Oracle数据库产品为财富排行榜上的前1000家公司所采用，许多大型网站也选用了Oracle系统，是世界最好的数据库产品。此外，Oracle公司还开发其他应用程序和软件。同时，Oracle在英语里还是“神谕”的意思，意为“替神说话的”，寓指Oracle公司的发展目标和决心地位。 亚马逊亚马逊公司（Amazon，简称亚马逊；NASDAQ：AMZN），是美国最大的一家网络电子商务公司，位于华盛顿州的西雅图。是网络上最早开始经营电子商务的公司之一，亚马逊成立于1994年，[12] 一开始只经营网络的书籍销售业务，现在则扩及了范围相当广的其他产品，已成为全球商品品种最多的网上零售商和全球第二大互联网企业，在公司名下，也包括了AlexaInternet、a9、lab126、和互联网电影数据库（Internet Movie Database，IMDB）等子公司。亚马逊及其它销售商为客户提供数百万种独特的全新、翻新及二手商品，如图书、影视、音乐和游戏、数码下载、电子和电脑、家居园艺用品、玩具、婴幼儿用品、食品、服饰、鞋类和珠宝、健康和个人护理用品、体育及户外用品、玩具、汽车及工业产品等。2004年8月，亚马逊全资收购卓越网。[1] [123] 2019年7月18日，亚马逊停止为亚马逊中国网站上的第三方卖家提供卖家服务。[3] 2022年5月，据美国媒体报道，亚马逊公司计划将3000多颗卫星送入近地轨道，以提供卫星互联网服务。这个项目被称为“柯伊伯计划”（ProjectKuiper）[108] 。2021年7月，杰夫·贝索斯正式卸任亚马逊首席执行官，由安迪·贾西继任。[12] 2021年《财富》世界500强排行榜第3位。[74] 英伟达NVIDIA（纳斯达克股票代码：NVDA）是一家人工智能计算公司[1] 。公司创立于1993年，总部位于美国加利福尼亚州圣克拉拉市。美籍华人Jensen Huang（黄仁勋）是创始人兼CEO。[2] 1999年，NVIDIA定义了GPU，这极大地推动了PC游戏市场的发展，重新定义了现代计算机图形技术，并彻底改变了并行计算。[3] 2017年6月，入选《麻省理工科技评论》“2017 年度全球50大最聪明公司”榜单。[4] 2020年7月8日美股收盘后，英伟达首次在市值上实现对英特尔的超越，成为美国市值最高的芯片厂商，这也是2014年后再次有新面孔站上美国芯片企业市值第一的位置[74] 。在GTC 2020主题演讲中，NVIDIA宣布推出Ampere架构，这是NVIDIA发布的第八代GPU架构，包含超过540亿个晶体管，性能相较于前代提升了高达20倍，也是NVIDIA 8代GPU历史上最大的一次性能飞跃。[5] NVIDIA A100是首款基于NVIDIA Ampere架构的GPU。作为一款通用型工作负载加速器，A100还被设计用于数据分析、科学计算和云图形。[6] 2020年5月21日，NVIDIA发布了截至2020年4月26日的2021年第一季度财务报告。第一季度收入达30.8亿美元，较同期的22.2亿美元增长39%。数据中心收入创下11.4亿美元的纪录，较同期增长80%。GAAP毛利润率创下65.1%的纪录。[7] 2022年，NVIDIA荣获美国最佳工作场所奖。[108] 2022年3月7日，NVIDIA宣布存储方案提供商 Excelero加入NVIDIA。[107] 苹果公司苹果公司（Apple Inc. ）是美国高科技公司。苹果营收达到3658亿美元，[169] 由史蒂夫·乔布斯、斯蒂夫·盖瑞·沃兹尼亚克和罗纳德·杰拉尔德·韦恩（Ron Wayne）等人于1976年4月1日创立，并命名为美国苹果电脑公司（Apple Computer Inc.），2007年1月9日更名为苹果公司，总部位于加利福尼亚州的库比蒂诺。苹果公司1980年12月12日公开招股上市，2012年创下6235亿美元的市值记录，截至2014年6月，苹果公司已经连续三年成为全球市值最大公司。当地时间2020年8月19日，苹果公司市值首次突破2万亿美元。[1] 苹果公司在2016年世界500强排行榜中排名第9名。[2] 2013年9月30日，在宏盟集团的“全球最佳品牌”报告中，苹果公司超过可口可乐成为世界最有价值品牌。2014年，苹果品牌超越谷歌（Google），成为世界最具价值品牌。2021年《财富》世界500强排行榜第6名。[125] 北京时间2022年1月4日凌晨2点45分左右，美国科技巨头苹果的股价达到了182.88美元，市值第一次站上了三万亿美元的台阶，这不仅是全球首个3万亿市值，也相当于全球第五大经济体的GDP体量，仅次于美国、中国、日本及德国。[147] 2022年8月31日，苹果隐私主管 Jane Horvath 将离开公司，加入一家律师事务所。[232] 据美国《华尔街日报》网站2022年10月22日报道，苹果公司负责工业设计的主管即将离职，这标志着其负责设计iPhone、Mac和其他流行消费产品标志性外观的部门的又一重大人员流失。[250] 微软微软（Microsoft）是一家美国跨国科技企业，由比尔·盖茨和保罗·艾伦于1975年4月4日创立。公司总部设立在华盛顿州雷德蒙德（Redmond，邻近西雅图），以研发、制造、授权和提供广泛的电脑软件服务业务为主[1] 。最为著名和畅销的产品为Windows操作系统和Office系列软件，是全球最大的电脑软件提供商、世界PC（Personal Computer，个人计算机）软件开发的先导。2017年全球最赚钱企业排行榜第15[2] 。2018年BrandZ全球最具价值品牌100强第4位[3] 。2018世界品牌500强第4位[4] 。2019福布斯全球数字经济100强榜排名第2位[5] 。Interbrand全球品牌百强排名第四位[6] 。2020年《财富》全球最受赞赏公司榜单第3位[7] 。2020福布斯全球企业2000强榜第13位[8-9] 。福布斯2020全球品牌价值100强第3位。2021福布斯全球企业2000强第15位[43] 。2022年8月，入选《2022世界品牌500强》榜单，排名第2位。[113-114] 2021年6月23日，微软市值突破2万亿美元，是继苹果之后美国第二家市值突破2万亿美元的企业[53] 。 特斯拉特斯拉（Tesla）是美国一家电动汽车及能源公司，总部位于帕洛阿托（Palo Alto）[1] ，市值达2100亿美元，[196] 产销电动汽车、太阳能板、及储能设备。2003年7月1日，由马丁·艾伯哈德和马克·塔彭宁共同创立，创始人将公司命名为“特斯拉汽车”，以纪念物理学家尼古拉·特斯拉。特斯拉努力为每一个普通消费者提供其消费能力范围内的纯电动车辆；特斯拉的愿景是『加速全球向可持续能源的转变』。[7] 2008年，发布第一款汽车产品——两门运动型跑车Roadster。[2] 2012年，发布第二款汽车产品——四门纯电动豪华轿跑车Model S[3] ；第三款汽车产品为Model X，豪华纯电动SUV[4] ，于2015年9月开始交付。[5] 特斯拉下一款汽车Model 3首次公开于2016年3月[6] ，已于2017年末开始交付。2019年2月，马斯克宣布将开放所有特斯拉电动汽车的专利[10] 。2021年3月24日，美国特斯拉官网宣布支持比特币付款，特斯拉成为史上第一家支持比特币购车的车企[98] 。4月19日，上海车展上一位身穿印有“刹车失灵”T恤衫的车主站上特斯拉车顶维权[100] 。（主词条：4·19特斯拉车主维权事件）6月18日消息，美监管部门对特斯拉事故启动30项调查，涉及10人死亡。[120] 6月26日消息，特斯拉召回28万辆车并致歉[121] 8月16日，美国政府已对特斯拉的自动驾驶系统展开正式调查。调查涵盖了特斯拉当前所有车型，即从2014年到2021年的ModelsY、X、S和3，涉事车辆达765000辆。[126] 特斯拉第三季度共生产了超过36.5万辆汽车，交付了超过34.3万辆汽车。[277] 三星三星集团（英文：SAMSUNG、韩文：삼성）是韩国最大的跨国企业集团，三星集团包括众多的国际下属企业，旗下子公司有：三星电子、三星物产、三星人寿保险等，业务涉及电子、金融、机械、化学等众多领域。三星集团成立于1938年，由李秉喆创办。三星集团是家族企业，李氏家族世袭，旗下各个三星产业均为家族产业，并由家族中的其他成员管理。[1-2] 旗下子公司包含：三星电子、三星SDI、三星SDS、三星电机、三星康宁、三星网络、三星火灾、三星证券、三星物产、三星重工、三星工程、三星航空和三星生命等，由家族内的李氏成员管理，其中三家子公司被美国《财富》杂志评选为世界500强企业。三星电子是旗下最大的子公司，2009年全球500强企业中三星电子排名第40位，全球最受尊敬企业排名第50位，三星的品牌价值排名第19位，较2008年又有了2位的进步。在2011年的全球企业市值中为1500亿美元。[3] 2016年11月4日晚间消息，三星电子美国公司宣布，将主动召回280万台特定型号的顶部开盖洗衣机。[4] 2018年二季度三星在印度的手机发货量为800万部，市场份额为23%，排名第二，仅次于小米。[5-8] 李克强总理表示：三星电子在华设立的全资子公司累计完成投资108.7亿美元，预计总投资150亿美元。[9] 2020年4月，三星宣布退出LCD面板市场，于2020年年底关停旗下在韩国和中国的所有LCD面板产线。[10] 小米小米科技有限责任公司成立于2010年3月3日，是专注于智能硬件和电子产品研发、智能手机、智能电动汽车[381] 、互联网电视及智能家居生态链建设的全球化移动互联网企业、创新型科技企业。[2-3] 小米公司创造了用互联网模式开发手机操作系统、发烧友参与开发改进的模式。“为发烧而生”是小米的产品概念。“让每个人都能享受科技的乐趣”是小米公司的愿景。小米公司应用了互联网开发模式开发产品，用极客精神做产品，用互联网模式干掉中间环节，致力让全球每个人，都能享用来自中国的优质科技产品。小米已经建成了全球最大消费类IoT物联网平台，连接超过5.58[408] 亿台智能设备，进入全球100多个国家和地区。[4] [310] MIUI全球月活跃用户达到5.64亿[380] 。小米系投资的公司超500家，覆盖智能硬件、生活消费用品、教育、游戏、社交网络、文化娱乐、医疗健康、汽车交通、金融等领域。[283] 2019年6月，入选2019福布斯中国最具创新力企业榜。[5-6] 10月，2019福布斯全球数字经济100强榜发布，小米位列第56位。[7] 12月18日，人民日报“中国品牌发展指数”100榜单排名30位。[8] 2021年3月30日，小米集团在港交所发布公告，正式宣布进入造车领域。[200] 同日，小米启用新Logo。[201] 2022年8月，在世界500强企业中排名第266位，大幅提升72名。[317] 收购自动驾驶技术公司深动科技，布局自动驾驶核心技术。[242] 全球三大智能手机制造商之一，也拥有全球最大的消费级智能物联网平台。[311] 是全球以及中国区增速最快的智能手机品牌。[224] OPPOOPPO（OPPO广东移动通信有限公司），是由陈明永等人于2004年创立，[113] 是一家全球领先的智能终端制造商和移动互联网服务提供商[114] ，业务遍及50多个国家和地区。[115] 通过40多万个销售网点及2500个服务中心，与全球用户共享科技之美。[116] OPPO用手机解锁未来，当未来已来，OPPO用万物互融定义它，让用户尽享智慧数字生活。[117] 在深耕手机业务的同时，OPPO于2019年开始构建多智能终端生态，为用户打造跨场景高频使用的入口级产品。[118] 当前，OPPO已搭建智能电视，穿戴，声学以及其他配件等IOT产品矩阵。[119] 作为一家软硬服一体化的科技公司，OPPO不断优化以ColorOS为核心的软件平台[120] ，为全球4.4亿ColorOS月活用户打造更人性化、更智能的移动操作系统。[121] 同时，OPPO通过软件商店、云服务、智能助手的不断升级，为用户探索更快捷、更智能和更互联的增值服务。[122] OPPO在全球共有六大研究所和四大研发中心，拥有超过40000名员工。2018全年，OPPO在全球智能手机市场中出货量共1.131亿部，以8.1%的市场份额位居第五；同时，在中国智能手机市场，OPPO手机年出货量共7890万部，以19.8%的市场份额位居第二。OPPO一直专注手机拍照的技术创新，开创了“自拍美颜”时代；全球超过2亿人正在使用OPPO拍照手机。[1] 2019年12月，OPPO入选2019中国品牌强国盛典榜样100品牌。[2] 2020年1月4日，获得2020《财经》长青奖“可持续发展创新奖”。2021年4月，OPPO全球专利申请量超过6.1万件，全球授权数量超过2.6万件。[61] vivovivo品牌产品包括智能手机、平板电脑、智能手表等[103] ，截至2022年8月，进驻60多个国家和地区，全球用户覆盖4亿多人，研发覆盖深圳、东莞（总部）、北京、上海、南京、杭州、西安等。2011年11月vivo发布首款智能手机；2019年3月vivo发布子品牌iQOO，宣传“生而强悍探索不止”理念。[102] 2021年9月6日vivo自主研发的首款专业影像芯片vivo V1亮相，开启手机硬件级算法时代。[105-106] 2018年vivo以创新技术出色获得“人民之选匠心企业奖”，2019年12月25日vivo凭借创新力与5G产研能力获人民匠心产品奖、人民匠心品牌奖。[104] 2021年12月2日，vivo联合中国听力医学发展基金会发起为期三年的公益计划，宣誓“无声的爱，我们不想错过你的每一次成长”。[98] [107] 2022年7月21日，vivo联合一个地球自然基金会共同发起“国家公园守护行动”，通过科技创新助力国家公园建设与生物多样性保护。[108] 2014年4月vivo进入东南亚市场；2016年10月vivo在北京和深圳成立5G研发中心；2017年5月vivo和FIFA达成6年的FIFA俄罗斯世界杯全球官方赞助合作；2021年6月vivo宣布和2020欧洲杯官方合作；[98] 2022年4月vivoPad平板电脑开售[99] ，vivo X Fold双屏折叠智能手机也开售[100] ；2022年6月9日vivo X Fold获得新的吉尼斯世界纪录[101] 。2022年11月22日，vivo X90系列新品发布会召开，[123] vivo除了带来标准版X90之外，还带来了X90 Pro+，vivo赵典称其为“1英寸之王”。[124] 腾讯深圳市腾讯计算机系统有限公司成立于1998年11月，由马化腾、张志东、许晨晔、陈一丹、曾李青五位创始人共同创立。 腾讯多元化的服务包括：社交和通信服务QQ及微信/WeChat、社交网络平台QQ空间、腾讯游戏旗下QQ游戏平台、门户网站腾讯网、腾讯新闻客户端和网络视频服务腾讯视频等。[1] 2004年腾讯公司在香港联交所主板公开上市（股票代号00700），董事会主席兼首席执行官是马化腾。财报显示，于2021年12月31日，腾讯集团有112771名雇员(2020年:85858名)。[209] 2018年6月20日，世界品牌实验室（World Brand Lab）在北京发布了2018年《中国500最具价值品牌》分析报告。腾讯居第二位。2018年12月，世界品牌实验室编制的《2018世界品牌500强》揭晓，排名第39。[2] 2019年7月，发布2019《财富》世界500强：位列237位。[3] 2019年8月，入选2019年中国最佳董事会50强。[4] 2019年9月1日，2019中国服务业企业500强榜单在济南发布，腾讯控股有限公司排名第32位。[5] 2019年10月，2019福布斯全球数字经济100强榜位列14位。[6] 2019年10月23日， 2019《财富》未来50强榜单公布，腾讯控股有限公司排名第12。[7] “一带一路”中国企业100强榜单排名第14位。[8] 2019年12月，腾讯入选2019中国品牌强国盛典榜样100品牌。[9] 2019年12月18日，人民日报发布中国品牌发展指数100榜单，腾讯排名第4位。[10] 2021年9月，入选“2021年中国民营企业500强”榜单，排名6位。[170] 2022年5月12日，中消协发布“五一”消费维权舆情分析报告，腾讯等企业被点名。[217] 编程语言JavaJava是一门面向对象的编程语言，不仅吸收了C++语言的各种优点，还摒弃了C++里难以理解的多继承、指针等概念，因此Java语言具有功能强大和简单易用两个特征。Java语言作为静态面向对象编程语言的代表，极好地实现了面向对象理论，允许程序员以优雅的思维方式进行复杂的编程[1] 。Java具有简单性、面向对象、分布式、健壮性、安全性、平台独立与可移植性、多线程、动态性等特点[2] 。Java可以编写桌面应用程序、Web应用程序、分布式系统和嵌入式系统应用程序等[3] 。 C++C++是一种计算机高级程序设计语言，由C语言扩展升级而产生[17] ，最早于1979年由本贾尼·斯特劳斯特卢普在AT&amp;T贝尔工作室研发。[2] C++既可以进行C语言的过程化程序设计，又可以进行以抽象数据类型为特点的基于对象的程序设计，还可以进行以继承和多态为特点的面向对象的程序设计。C++擅长面向对象程序设计的同时，还可以进行基于过程的程序设计。C++拥有计算机运行的实用性特征，同时还致力于提高大规模程序的编程质量与程序设计语言的问题描述能力。[1] RustRust是一门系统编程语言[1] ，专注于安全[2] ，尤其是并发安全，支持函数式和命令式以及泛型等编程范式的多范式语言。Rust在语法上和C++类似[3] ，但是设计者想要在保证性能的同时提供更好的内存安全。 Rust最初是由Mozilla研究院的Graydon Hoare设计创造，然后在Dave Herman, Brendan Eich以及很多其他人的贡献下逐步完善的。[4] Rust的设计者们通过在研发Servo网站浏览器布局引擎过程中积累的经验优化了Rust语言和Rust编译器。[5] Rust编译器是在MIT License 和 Apache License 2.0双重协议声明下的免费开源软件。 Rust已经连续七年（2016，2017，2018，2019，2020, 2021, 2022）在Stack Overflow开发者调查的“最受喜爱编程语言”评选项目中折取桂冠。[6-10] [19-20] 冒泡排序冒泡排序（Bubble Sort），是一种计算机科学领域的较简单的排序算法。它重复地走访过要排序的元素列，依次比较两个相邻的元素，如果顺序（如从大到小、首字母从Z到A）错误就把他们交换过来。走访元素的工作是重复地进行，直到没有相邻元素需要交换，也就是说该元素列已经排序完成。这个算法的名字由来是因为越小的元素会经由交换慢慢“浮”到数列的顶端（升序或降序排列），就如同碳酸饮料中二氧化碳的气泡最终会上浮到顶端一样，故名“冒泡排序”。 选择排序选择排序（Selection sort）是一种简单直观的排序算法。它的工作原理是：第一次从待排序的数据元素中选出最小（或最大）的一个元素，存放在序列的起始位置，然后再从剩余的未排序元素中寻找到最小（大）元素，然后放到已排序的序列的末尾。以此类推，直到全部待排序的数据元素的个数为零。选择排序是不稳定的排序方法。[1] 插入排序插入排序，一般也被称为直接插入排序。对于少量元素的排序，它是一个有效的算法[1] 。插入排序是一种最简单的排序方法，它的基本思想是将一个记录插入到已经排好序的有序表中，从而一个新的、记录数增1的有序表。在其实现过程使用双层循环，外层循环对除了第一个元素之外的所有元素，内层循环对当前元素前面有序表进行待插入位置查找，并进行移动[2] 。 希尔排序希尔排序(Shell’s Sort)是插入排序的一种又称“缩小增量排序”（Diminishing Increment Sort），是直接插入排序算法的一种更高效的改进版本。希尔排序是非稳定排序算法。该方法因 D.L.Shell 于 1959 年提出而得名。希尔排序是把记录按下标的一定增量分组，对每组使用直接插入排序算法排序；随着增量逐渐减少，每组包含的关键词越来越多，当增量减至 1 时，整个文件恰被分成一组，算法便终止。[1] 桶排序桶排序 (Bucket sort)或所谓的箱排序，是一个排序算法，工作的原理是将数组分到有限数量的桶子里。每个桶子再个别排序（有可能再使用别的排序算法或是以递归方式继续使用桶排序进行排序）。桶排序是鸽巢排序的一种归纳结果。当要被排序的数组内的数值是均匀分配的时候，桶排序使用线性时间（Θ（n））。但桶排序并不是 比较排序，他不受到 O(n log n) 下限的影响。 动态规划动态规划（Dynamic Programming，DP）是运筹学的一个分支，是求解决策过程最优化的过程。20世纪50年代初，美国数学家贝尔曼（R.Bellman）等人在研究多阶段决策过程的优化问题时，提出了著名的最优化原理，从而创立了动态规划。动态规划的应用极其广泛，包括工程技术、经济、工业生产、军事以及自动化控制等领域，并在背包问题、生产经营问题、资金管理问题、资源分配问题、最短路径问题和复杂系统可靠性问题等中取得了显著的效果[1] 。[2] 深度优先搜索深度优先搜索是一种在开发爬虫早期使用较多的方法。它的目的是要达到被搜索结构的叶结点(即那些不包含任何超链的HTML文件) 。在一个HTML文件中，当一个超链被选择后，被链接的HTML文件将执行深度优先搜索，即在搜索其余的超链结果之前必须先完整地搜索单独的一条链。深度优先搜索沿着HTML文件上的超链走到不能再深入为止，然后返回到某一个HTML文件，再继续选择该HTML文件中的其他超链。当不再有其他超链可选择时，说明搜索已经结束。[1] 广度优先搜索宽度优先搜索算法（又称广度优先搜索）是最简便的图的搜索算法之一，这一算法也是很多重要的图的算法的原型。Dijkstra单源最短路径算法和Prim最小生成树算法都采用了和宽度优先搜索类似的思想。其别名又叫BFS，属于一种盲目搜寻法，目的是系统地展开并检查图中的所有节点，以找寻结果。换句话说，它并不考虑结果的可能位置，彻底地搜索整张图，直到找到结果为止。 递归算法递归算法（英语：recursion algorithm）在计算机科学中是指一种通过重复将问题分解为同类的子问题而解决问题的方法。递归式方法可以被用于解决很多的计算机科学问题，因此它是计算机科学中十分重要的一个概念。绝大多数编程语言支持函数的自调用，在这些语言中函数可以通过调用自身来进行递归。计算理论可以证明递归的作用可以完全取代循环，因此在很多函数编程语言（如Scheme）中习惯用递归来实现循环。 贪心算法贪心算法（greedy algorithm[8] ，又称贪婪算法）是指，在对问题求解时，总是做出在当前看来是最好的选择。也就是说，不从整体最优上加以考虑，算法得到的是在某种意义上的局部最优解[1] 。贪心算法不是对所有问题都能得到整体最优解，关键是贪心策略的选择[1] 。 分治算法分治算法的基本思想是将一个规模为N的问题分解为K个规模较小的子问题，这些子问题相互独立且与原问题性质相同。求出子问题的解，就可得到原问题的解。即一种分目标完成程序算法，简单问题可用二分法完成。 栈栈（stack）又名堆栈，它是一种运算受限的线性表。限定仅在表尾进行插入和删除操作的线性表。这一端被称为栈顶，相对地，把另一端称为栈底。向一个栈插入新元素又称作进栈、入栈或压栈，它是把新元素放到栈顶元素的上面，使之成为新的栈顶元素；从一个栈删除元素又称作出栈或退栈，它是把栈顶元素删除掉，使其相邻的元素成为新的栈顶元素。 队列队列是一种特殊的线性表，特殊之处在于它只允许在表的前端（front）进行删除操作，而在表的后端（rear）进行插入操作，和栈一样，队列是一种操作受限制的线性表。进行插入操作的端称为队尾，进行删除操作的端称为队头。 树树是一种数据结构，它是由n(n≥0)个有限节点组成一个具有层次关系的集合。把它叫做“树”是因为它看起来像一棵倒挂的树，也就是说它是根朝上，而叶朝下的。它具有以下的特点：每个节点有零个或多个子节点；没有父节点的节点称为根节点；每一个非根节点有且只有一个父节点；除了根节点外，每个子节点可以分为多个不相交的子树。[1] 应用软件微信微信（WeChat）是腾讯公司于2011年1月21日推出的一个为智能终端提供即时通讯服务的免费应用程序[1] ，由张小龙所带领的腾讯广州研发中心产品团队打造 [2] 。微信支持跨通信运营商、跨操作系统平台通过网络快速发送免费（需消耗少量网络流量）语音短信、视频、图片和文字，同时，也可以使用通过共享流媒体内容的资料和基于位置的社交插件“摇一摇”、“朋友圈”、”公众平台“、”语音记事本“等服务插件。截止到2016年第二季度，微信已经覆盖中国94%以上的智能手机，月活跃用户达到8.06亿，[3] 用户覆盖200多个国家和地区、超过20种语言[4] 。此外，各品牌的微信公众账号总数已经超过800万个，移动应用对接数量超过85000个，广告收入增至36.79亿人民币[3] ，微信支付用户则达到了4亿左右[4] 。微信提供公众平台、朋友圈、消息推送等功能，用户可以通过“摇一摇”、“搜索号码”、“附近的人”、扫二维码方式添加好友和关注公众平台，同时微信将内容分享给好友以及将用户看到的精彩内容分享到微信朋友圈。2020年12月，iOS端微信更新至7.0.20版本，同时，个人资料页多了一项“微信豆”[5] 。2021年1月21日，微信更新至8.0版本[6] 。2021年7月，在最新推出的8.0.8版本中，微信不仅可以同时登陆手机、PC/Mac设备，还增加了平板设备的同时登陆功能，这也就意味着，平板设备在微信的使用逻辑中已经与手机和电脑处于平级，用户可以同时登陆的设备数量也达到了3台之多[110] 11月7日消息。微信用户投诉页新增“粉丝无底线追星行为”项[121] 。 QQQQ，是腾讯QQ的简称，是腾讯公司推出的一款基于互联网的即时通信软件。[57] QQ覆盖了Windows、macOS、iPadOS、Android、iOS、Harmony OS、Windows Phone、Linux等多种操作平台。其标志是一只戴着红色围巾的小企鹅。[58] 腾讯QQ支持在线聊天、视频通话、点对点断点续传文件、共享文件、网络硬盘、自定义面板、QQ邮箱等多种功能，并可与多种通讯终端相连。[58] 2022年7月，因业务调整，QQ群信用星级功能将正式下线，其他功能可正常使用不受影响。[65] 2022年12月，根据腾讯QQ项目组消息，Windows端也将跟进底层架构更新，推出同样采用Electron框架的全新版本，并将在2023年开启内测。[81] 钉钉钉钉（Ding Talk）是阿里巴巴集团打造的企业级智能移动办公平台，是数字经济时代的企业组织协同办公和应用开发平台。[67] 钉钉将IM即时沟通、钉钉文档、钉闪会、钉盘、Teambition、OA审批、智能人事、钉工牌、工作台深度整合，打造简单、高效、安全、智能的数字化未来工作方式，助力企业的组织数字化和业务数字化，实现企业管理“人、财、物、事、产、供、销、存”的全链路数字化。[93] 可以通过钉钉开放平台上的SaaS软件，低成本、便利地搭建适合企业的数字化应用，通过钉钉整合企业所有数字化系统。不会代码的人也可以借助低代码工具，搭建个性化的CRM、ERP、OA、项目管理、进销存等系统。钉钉已经开放超过2000个API接口，为企业数字化转型提供开放兼容的环境。[93] 钉钉（DingTalk）是阿里巴巴集团专为中国企业打造的免费沟通和协同的多端平台，提供PC版，Web版，Mac版和手机版，支持手机和电脑间文件互传。[1] 钉钉因中国企业而生，帮助中国企业通过系统化的解决方案（微应用），全方位提升中国企业沟通和协同效率。 Microsoft Visual StudioMicrosoft Visual Studio（简称VS）是美国微软公司的开发工具包系列产品。VS是一个基本完整的开发工具集，它包括了整个软件生命周期中所需要的大部分工具，如UML工具、代码管控工具、集成开发环境(IDE)等等。所写的目标代码适用于微软支持的所有平台，包括Microsoft Windows、Windows Mobile、Windows CE、.NET Framework、.NET Compact Framework和Microsoft Silverlight 及Windows Phone。Visual Studio是最流行的Windows平台应用程序的集成开发环境。最新版本为 Visual Studio 2022[17] 版本，基于.NET Framework 4.8 。[17] 2021年4月19日，微软宣布2021年夏季发布 Visual Studio 2022 的首个预览版。[4] 2021年6月17日，首个预览版 Visual Studio 2022 Preview 1 正式发布[5] ，并且首次发布64位版本。 Sublime TextSublime Text 是一个文本编辑器（收费软件，可以无限期试用），同时也是一个先进的代码编辑器。Sublime Text是由程序员Jon Skinner于2008年1月份所开发出来，它最初被设计为一个具有丰富扩展功能的Vim。Sublime Text具有漂亮的用户界面和强大的功能，例如代码缩略图，Python的插件，代码段等。还可自定义键绑定，菜单和工具栏。Sublime Text 的主要功能包括：拼写检查，书签，完整的 Python API ， Goto 功能，即时项目切换，多选择，多窗口等等。Sublime Text 是一个跨平台的编辑器，同时支持Windows、Linux、Mac OS X等操作系统。 macOSmacOS是一套由苹果开发的运行于Macintosh系列电脑上的操作系统。macOS是首个在商用领域成功的图形用户界面操作系统。macOS是基于XNU混合内核的图形化操作系统，一般情况下在普通PC上无法安装的操作系统。网上也有在PC上运行的macOS（Hackintosh）。另外，疯狂肆虐的电脑病毒几乎都是针对Windows的，由于macOS的架构与Windows不同，所以很少受到电脑病毒的袭击。2020年11月13日凌晨2点，macOS Big Sur正式版发布。[1] 2021年10月26日，苹果如约向Mac用户推送了macOS Monterey 12.0.1正式版更新。[4] 2022年5月16日，macOS Monterey12.4发布。[11-12] 苹果宣布macOS Server于2022年4月21日停止服务。[8] 2022年10月25日，苹果发布macOS 13 正式版更新。[15] iOSiOS是由苹果公司开发的移动操作系统。[1] 苹果公司最早于2007年1月9日的Macworld大会上公布这个系统，最初是设计给iPhone使用的，后来陆续套用到iPod touch、iPad上。iOS与苹果的macOS操作系统一样，属于类Unix的商业操作系统。原本这个系统名为iPhone OS，因为iPad，iPhone，iPod touch都使用iPhone OS，所以2010年苹果全球开发者大会上宣布改名为iOS（iOS为美国思科公司网络设备操作系统注册商标，苹果改名已获得Cisco公司授权）。2016年1月，随着iOS 9.2.1版本的发布，苹果修复了一个存在了3年的漏洞。[2] 2018年9月22日，美国苹果公司在最新的操作系统中秘密加入了基于iPhone用户和该公司其他设备使用者的“信任评级”功能。2021年11月17日消息，据报道，苹果iOS 15.2 Beta泄露全新“SportsKit”框架[74] 。2022年1月28日，苹果向 iPhone 和 iPad 用户推送了 iOS / iPadOS 15.4 开发者预览版Beta更新（内部版本号：19E5209h），本次更新距离上次发布隔了 2 周时间，带来了 Universal Control 全局控制、全新的 emoji 表情、苹果钱包 Apple Card 小部件等新功能。[78] 2月22日，据报道苹果 iOS 15.4，3月发布。[82] BlenderBlender是一款免费开源三维图形图像软件，提供从建模、动画、材质、渲染、到音频处理、视频剪辑等一系列动画短片制作解决方案。Blender拥有方便在不同工作下使用的多种用户界面，内置绿屏抠像、摄像机反向跟踪、遮罩处理、后期结点合成等高级影视解决方案。Blender内置有Cycles渲染器与实时渲染引擎EEVEE[1] 。同时还支持多种第三方渲染器。Blender为全世界的媒体工作者和艺术家而设计，可以被用来进行三维可视化，同时也可以创作广播和电影级品质的视频，另外内置的实时三维游戏引擎，让制作独立回放的三维互动内容成为可能（游戏引擎在2.8版本被移除[1] ）。 Microsoft EdgeMicrosoft Edge是由微软开发的基于 Chromium 开源项目及其他开源软件的网页浏览器。2015年4月30日，微软在旧金山举行的Build 2015开发者大会上宣布——Windows 10内置代号为“Project Spartan”的新浏览器被正式命名为“Microsoft Edge”，其内置于Windows 10版本中。2018年3月，微软宣布Edge登陆iPad和Android平板。这意味着Edge浏览器已经覆盖了桌面平台和移动平台。用户被允许在Google Play和App Store上下载Edge。[1-2] 2022年5月16日，微软官方发布公告，称IE浏览器于2022年6月16日正式退役，此后其功能将由Edge浏览器接棒。[24] 腾讯会议腾讯会议是腾讯云旗下的一款音视频会议软件，于2019年12月底上线。具有300人在线会议、全平台一键接入、音视频智能降噪、美颜、背景虚化、锁定会议、屏幕水印等功能。该软件提供实时共享屏幕、支持在线文档协作。[1] 2020年1月24日起腾讯会议面向用户免费开放300人的会议协同能力，直至疫情结束。此外，为助力全球各地抗疫，腾讯会议还紧急研发并上线了国际版应用[2] 。3月23日，腾讯会议开放API接口[3] 。2022年6月30日，腾讯会议应用市场正式上线[6] 。 OBS StudioOBS Studio 是一款实时流媒体和屏幕录制软件，在直播领域使用的比较广泛，它是用 C、C++ 和 Qt 编写的。[1] WPS OfficeWPS Office是由北京金山办公软件股份有限公司自主研发的一款办公软件套装，1989年由求伯君正式推出WPS1.0。[27] 可以实现办公软件最常用的文字、表格、演示，PDF阅读等多种功能。具有内存占用低、运行速度快、云功能多、强大插件平台支持、免费提供在线存储空间及文档模板的优点。支持阅读和输出PDF（.pdf）文件、具有全面兼容微软Office97-2010格式（doc/docx/xls/xlsx/ppt/pptx等）独特优势。覆盖Windows、Linux、Android、iOS等多个平台。WPS Office支持桌面和移动办公。且WPS移动版通过Google Play平台，已覆盖超50多个国家和地区。2020年12月，教育部考试中心宣布WPS Office将作为全国计算机等级考试(NCRE)的二级考试科目之一，于2021年在全国实施。[1] 2021年10月，藏文版在拉萨发布。[18] 2022年7月，维哈柯文版在在乌鲁木齐发布。[20] 金山办公软件副总裁章庆元在社交媒体上表示pc版已经极少广告，计划2023年彻底关闭WPS广告业务。[25] Microsoft OfficeMicrosoft Office[11] 是由Microsoft(微软)公司开发的一套办公软件套装。常用组件有 Word、Excel、PowerPoint等。 PyCharmPyCharm是一种Python IDE（Integrated Development Environment，集成开发环境），带有一整套可以帮助用户在使用Python语言开发时提高其效率的工具，比如调试、语法高亮、项目管理、代码跳转、智能提示、自动完成、单元测试、版本控制。此外，该IDE提供了一些高级功能，以用于支持Django框架下的专业Web开发。 Adobe PhotoshopAdobe Photoshop，简称“PS”，是由Adobe Systems开发和发行的图像处理软件。Photoshop主要处理以像素所构成的数字图像。使用其众多的编修与绘图工具，可以有效地进行图片编辑和创造工作。PS 有很多功能，在图像、图形、文字、视频、出版等各方面都有涉及。Adobe支持Windows操作系统 、Android与Mac OS， 但Linux操作系统用户可以通过使用Wine来运行Photoshop。 AdobeAdobe系统公司（英语：Adobe Systems Incorporated，发音：宽式IPA：/əˈdoʊbiː/，其官方大中华部门内也常以中文“奥多比”自称。股票代码：NASDAQ：ADBE、LSE：ABS），是美国一家跨国电脑软件公司，总部位于加州的圣何塞。2017年10月24日，Adobe全球官方培训认证体系（Adobe中国授权培训中心）暨Adobe国际认证项目启动。[1] FirefoxMozilla Firefox，中文俗称“火狐”（正式缩写为Fx或fx[1] ），是一个由Mozilla开发的自由及开放源代码的网页浏览器。 GitGit（读音为/gɪt/）是一个开源的分布式版本控制系统，可以有效、高速地处理从很小到非常大的项目版本管理。[1] 也是Linus Torvalds为了帮助管理Linux内核开发而开发的一个开放源码的版本控制软件。Torvalds 开始着手开发 Git 是为了作为一种过渡方案来替代 BitKeeper[1] 。 网络安全网络爬虫网络爬虫（又称为网页蜘蛛，网络机器人，在FOAF社区中间，更经常的称为网页追逐者），是一种按照一定的规则，自动地抓取万维网信息的程序或者脚本。另外一些不常使用的名字还有蚂蚁、自动索引、模拟程序或者蠕虫。 DDos分布式拒绝服务攻击可以使很多的计算机在同一时间遭受到攻击，使攻击的目标无法正常使用，分布式拒绝服务攻击已经出现了很多次，导致很多的大型网站都出现了无法进行操作的情况，这样不仅仅会影响用户的正常使用，同时造成的经济损失也是非常巨大的。[1] 分布式拒绝服务攻击方式在进行攻击的时候，可以对源IP地址进行伪造，这样就使得这种攻击在发生的时候隐蔽性是非常好的，同时要对攻击进行检测也是非常困难的，因此这种攻击方式也成为了非常难以防范的攻击。[1] 互联网常用词汇门户网站所谓门户网站，是指提供某类综合性互联网信息资源并提供有关信息服务的应用系统。在全球范围中，最为著名的门户网站则是谷歌以及雅虎，而在中国，著名的门户网站有新浪、网易、搜狐、腾讯、百度、新华网、人民网、凤凰网等。 垂直门户在Web上，垂直门户(vertical portal，有时也称为Vortal)是指。提供与特定行业如卫生保健、保险、汽车或食品制造的相关信息的入口或门户(portal)的网站 新媒体新媒体是利用数字技术，通过计算机网络、无线通信网、卫星等渠道，以及电脑、手机、数字电视机等终端，向用户提供信息和服务的传播形态。从空间上来看，“新媒体”特指当下与“传统媒体”相对应的，以数字压缩和无线网络技术为支撑，利用其大容量、实时性和交互性，可以跨越地理界线最终得以实现全球化的媒体。[1] 变局成为2021—2022年中国新媒体行业发展的关键词，围绕战略传播、数字经济、元宇宙、网络治理、互联网出海等热点内容，新媒体行业发展成果显著、特点鲜明，展现出巨大活力与创新力，下一代互联网正在走来。[5] 自媒体自媒体是指普通大众通过网络等途径向外发布他们本身的事实和新闻的传播方式。“自媒体”，英文为“We Media”。是普通大众经由数字科技与全球知识体系相连之后，一种提供与分享他们本身的事实和新闻的途径。是私人化、平民化、普泛化、自主化的传播者，以现代化、电子化的手段，向不特定的大多数或者特定的单个人传递规范性及非规范性信息的新媒体的总称。[1] SNS社交网络服务（Social Networking Service，简称SNS），专指在帮助人们建立社会性网络的互联网应用服务，也指社会现有已成熟普及的信息载体，如短信SMS服务。它是Web 2.0体系下的一个技术应用架构。放在Web 2.0的背景下，每个用户都拥有自己的Blog、自己维护的Wiki、社会化书签或者Podcast.用户通过Tag 、RSS 或者IM、邮件等方式连接到一起，每个个体的社交圈都不断放大，最后成为一个大型网络，这就是社交网络服务（SNS）。” IM智能制造，源于人工智能的研究，一般认为智能是知识和智力的总和，前者是智能的基础，后者是指获取和运用知识求解的能力。智能制造应当包含智能制造技术和智能制造系统，智能制造系统不仅能够在实践中不断地充实知识库，而且还具有自学习功能，还有搜集与理解环境信息和自身的信息，并进行分析判断和规划自身行为的能力。 去中心化去中心化（英语：decentralization）是互联网发展过程中形成的社会关系形态和内容产生形态，是相对于“中心化”而言的新型网络内容生产过程。相对于早期的互联网（Web 1.0）时代，Web 2.0内容不再是由专业网站或特定人群所产生，而是由权级平等的全体网民共同参与、共同创造的结果。任何人都可以在网络上表达自己的观点或创造原创的内容，共同生产信息。随着网络服务形态的多元化，去中心化网络模型越来越清晰，也越来越成为可能。Web 2.0兴起后，Wikipedia、Flickr、Blogger等网络服务商所提供的服务都是去中心化的，任何参与者均可提交内容，网民共同进行内容协同创作或贡献。之后随着更多简单易用的去中心化网络服务的出现，Web2.0的特点越发明显。例如Twitter、Facebook等更加适合普通网民的服务的诞生，使得为互联网生产或贡献内容更加简便、更加多元化，从而提升了网民参与贡献的积极性、降低了生产内容的门槛。最终使得每一个网民均成为了一个微小且独立的信息提供商，使得互联网更加扁平、内容生产更加多元化。 IPIP指网际互连协议，Internet Protocol的缩写，是TCP/IP体系中的网络层协议。设计IP的目的是提高网络的可扩展性：一是解决互联网问题，实现大规模、异构网络的互联互通；二是分割顶层网络应用和底层网络技术之间的耦合关系，以利于两者的独立发展。根据端到端的设计原则，IP只为主机提供一种无连接、不可靠的、尽力而为的数据包传输服务。[1] ACGacg即Animation（动画）、Comics（漫画）与Games（游戏）的首字母缩写，来源不是英语，也不是一个英语单词，并没有完全对应的广泛使用的中文翻译。[1-2] ACG一词为中国的台湾省创造，流行于华语文化圈，ACG文化发源于日本，但在日本从不使用这个词，在英语文化圈里也并不普及。 流量是指单位时间内流经封闭管道或明渠有效截面的流体量，又称瞬时流量。当流体量以体积表示时称为体积流量；当流体量以质量表示时称为质量流量。单位时间内流过某一段管道的流体的体积，称为该横截面的体积流量。简称为流量，用Q来表示。 DAUDAU(Daily Active User)，日活跃用户数量。一般用于反映网站、互联网应用等运营情况。结合MAU（月活跃用户数量）一起使用，用来衡量服务的用户粘性以及服务的衰退周期。[1] 。 MAUMAU（Monthly Active User）是一个用户数量统计名词，指网站、app等月活跃用户数量（去除重复用户数）。数量的大小反映用户的活跃度，但是无法反映用户的粘性。 ROI投资回报率（ROI）是指通过投资而应返回的价值，即企业从一项投资活动中得到的经济回报。它涵盖了企业的获利目标。利润和投入经营所必备的财产相关，因为管理人员必须通过投资和现有财产获得利润。投资可分为实业投资和金融投资两大类，人们平常所说的金融投资主要是指证券投资。 APRU环太平洋大学联盟（英文：Association of Pacific Rim Universities），简称APRU，是由环太平洋地区各国的研究型大学组成的高校联盟。联盟成立于1997年，由美国加州理工学院、加利福尼亚大学伯克利分校、加利福尼亚大学洛杉矶分校和南加利福尼亚大学四所大学的校长共同发起。其宗旨是为成员大学建立交流与共同发展的平台。[1-3] 环太平洋大学联盟是亚太经济合作组织的官方顾问机构，在科学、技术和人文资源三方面为其提供咨询和顾问，协助其创建由环太平洋国家组成的共同体。联盟将战略框架定位于在亚太地区构建高等教育与研究，培养全球领袖并且合作解决亚太地区的困难与挑战。[3-4] 截至2022年9月，环太平洋大学联盟成员包括17个国家的共60所大学，其中中国内地高校成员12所、中国香港高校成员3所、中国台湾高校成员2所。[7] CTRCTR（Click-Through-Rate）即点击通过率，是互联网广告常用的术语，指网络广告（图片广告/文字广告/关键词广告/排名广告/视频广告等）的点击到达率，即该广告的实际点击次数（严格的来说，可以是到达目标页面的数量）除以广告的展现量（Show content）。CTR是衡量互联网广告效果的一项重要指标。 PV页面浏览量，通常是衡量一个网络新闻频道或网站甚至一条网络新闻的主要指标。网页浏览数是评价网站流量最常用的指标之一，简称为PV。监测网站PV的变化趋势和分析其变化原因是很多站长定期要做的工作。Page Views中的Page一般是指普通的html网页，也包含php、jsp等动态产生的html内容。来自浏览器的一次html内容请求会被看作一个PV，逐渐累计成为PV总数。 UV独立访客就是独立IP访客（Unique Visitor）,一般地用两个数值标准来统计访问某网站的访客，即“访问次数”和“独立访客（问）数”，访问次数和独立访客数是两个不同的概念。 TP双绞线（Twisted Pair，TP）是一种综合布线工程中最常用的传输介质，是由两根具有绝缘保护层的铜导线组成的。把两根绝缘的铜导线按一定密度互相绞在一起，每一根导线在传输中辐射出来的电波会被另一根线上发出的电波抵消，有效降低信号干扰的程度。双绞线一般由两根22～26号绝缘铜导线相互缠绕而成，“双绞线”的名字也是由此而来。实际使用时，双绞线是由多对双绞线一起包在一个绝缘电缆套管里的。如果把一对或多对双绞线放在一个绝缘套管中便成了双绞线电缆[1] ，但日常生活中一般把“双绞线电缆”直接称为“双绞线”。与其他传输介质相比，双绞线在传输距离，信道宽度和数据传输速度等方面均受到一定限制，但价格较为低廉。 KPI关键绩效指标（Key Performance Indicator，简称KPI）是通过对组织内部流程的输入端、输出端的关键参数进行设置、取样、计算、分析，衡量流程绩效的一种目标式量化管理指标，是把企业的战略目标分解为可操作的工作目标的工具，是企业绩效管理的基础。KPI可以是部门主管明确部门的主要责任，并以此为基础，明确部门人员的业绩衡量指标。建立明确的切实可行的KPI体系，是做好绩效管理的关键。关键绩效指标是用于衡量工作人员工作绩效表现的量化指标，是绩效计划的重要组成部分。KPI法符合一个重要的管理原理：“二八原理”。在一个企业的价值创造过程中，存在着“80/20”的规律，即20%的骨干人员创造企业80%的价值；而且在每一位员工身上“二八原理”同样适用，即80%工作任务是由20%关键行为完成的。因此，必须抓住20%的关键行为，对之进行分析和衡量，这样就能抓住业绩评价的重心。KPA（Key Process Area）意为关键过程领域，这些关键过程领域指出了企业需要集中力量改进和解决问题的过程。同时，这些关键过程领域指明了为了要达到该能力成熟度等级所需要解决的具体问题。每个KPA都明确地列出一个或多个的目标（Goal），并且指明了一组相关联的关键实践（Key Practices）。实施这些关键实践就能实现这个关键过程域的目标，从而达到增加过程能力的效果。KRA（Key Result Areas）意为关键结果领域，它是为实现企业整体目标、不可或缺的、必须取得满意结果的领域，是企业关键成功要素的聚集地。 UGCUGC 互联网术语，全称为User Generated Content，也就是用户生成内容，即用户原创内容。UGC的概念最早起源于互联网领域，即用户将自己原创的内容通过互联网平台进行展示或者提供给其他用户。UGC是伴随着以提倡个性化为主要特点的Web2.0概念而兴起的，也可叫做UCC（User-created Content）。它并不是某一种具体的业务，而是一种用户使用互联网的新方式，即由原来的以下载为主变成下载和上传并重。随着互联网运用的发展，网络用户的交互作用得以体现，用户既是网络内容的浏览者，也是网络内容的创造者。[1] PGCPGC（全称：Professional Generated Content）互联网术语，指专业生产内容。用来泛指内容个性化、视角多元化、传播民主化、社会关系虚拟化。也称为PPC,(Professionally-produced Content）。PGC（Professional Generated Content），指专业生产内容。经由传统广电业者按照几乎与电视节目无异的方式进行制作，但在内容的传播层面，却必须按照互联网的传播特性进行调整。[1] UED用户体验设计（英语：User Experience Design），是以用户为中心的一种设计手段，以用户需求为目标而进行的设计。设计过程注重以用户为中心，用户体验的概念从开发的最早期就开始进入整个流程，并贯穿始终。 TMT单位名称，TMT，英文缩写，全称为Thousand Metric Tonne，是一种常用的质量单位。 SNS社交网络服务（Social Networking Service，简称SNS），专指在帮助人们建立社会性网络的互联网应用服务，也指社会现有已成熟普及的信息载体，如短信SMS服务。它是Web 2.0体系下的一个技术应用架构。放在Web 2.0的背景下，每个用户都拥有自己的Blog、自己维护的Wiki、社会化书签或者Podcast.用户通过Tag 、RSS 或者IM、邮件等方式连接到一起，每个个体的社交圈都不断放大，最后成为一个大型网络，这就是社交网络服务（SNS）。” SEOSEO（Search Engine Optimization）：汉译为搜索引擎优化。是一种方式：利用搜索引擎的规则提高网站在有关搜索引擎内的自然排名。目的是让其在行业内占据领先地位，获得品牌收益。很大程度上是网站经营者的一种商业行为，将自己或自己公司的排名前移。 SEM搜索引擎营销：英文Search Engine Marketing ，我们通常简称为“SEM”。简单来说，搜索引擎营销就是基于搜索引擎平台的网络营销，利用人们对搜索引擎的依赖和使用习惯，在人们检索信息的时候将信息传递给目标用户。搜索引擎营销的基本思想是让用户发现信息，并通过点击进入网页，进一步了解所需要的信息。企业通过搜索引擎付费推广，让用户可以直接与公司客服进行交流、了解，实现交易。"}],"posts":[{"title":"计算机思维导论及C/C++开发环境搭建","slug":"计算机思维导论及C-C-开发环境搭建","date":"2022-12-12T08:27:07.000Z","updated":"2022-12-12T10:24:27.777Z","comments":true,"path":"2022/12/12/计算机思维导论及C-C-开发环境搭建/","link":"","permalink":"http://example.com/2022/12/12/%E8%AE%A1%E7%AE%97%E6%9C%BA%E6%80%9D%E7%BB%B4%E5%AF%BC%E8%AE%BA%E5%8F%8AC-C-%E5%BC%80%E5%8F%91%E7%8E%AF%E5%A2%83%E6%90%AD%E5%BB%BA/","excerpt":"计算机自1946年问世以来，几乎改变了整个世界。","text":"计算机自1946年问世以来，几乎改变了整个世界。 现在我们可以通过电脑来做很多事情，比如我们常常听到的什么人工智能、电子竞技、大数据等等，都和计算机息息相关，包括我们现在的手机、平板等智能设备，也是计算机转变而来的。各位可以看看最顶上的这张图片，如果你在小时候接触过计算机，那么一定对这张图片（照片拍摄于1996年，在美国加利福尼亚州加利福尼亚州的锁诺玛县）印象深刻，这张壁纸作为WindowsXP系统的默认壁纸，曾经展示在千家万户的电脑屏幕上。 也许你没有接触过计算机，也许你唯一接触计算机就是用来打游戏，也有可能你曾经捣鼓过计算机，在学习C语言之前，先让我们来了解一下计算机的世界。 计算机的世界计算机虽然名字听着很高级，不过它也是由一个个简单电路组成的。 这是我们在初中就学习过的电路图，不过这种电路太过简单，只能完成一些很基础的的操作，比如点亮小灯泡等。 很明显想要实现计算机怎么高级的运算机器，肯定是做不到的，这时我们就需要引入更加强大的数字电路了。 用数字信号完成对数字量进行算术运算和逻辑运算的电路称为数字电路，或数字系统。由于它具有逻辑运算和逻辑处理功能，所以又称数字逻辑电路。现代的数字电路由半导体工艺制成的若干数字集成器件构造而成。逻辑门是数字逻辑电路的基本单元。 计算机专业一般会在大一开放《数字电路》这门课程，会对计算机底层的数字电路实现原理进行详细介绍。 数字电路引入了逻辑判断，我们来看看简单的数字电路： 数字电路中，用电压的高低来区分出两种信号，低电压表示0，高电压表示1，由于只能通过这种方式表示出两种类型的信号，所以计算机采用的是二进制。 二进制是计算技术中广泛采用的一种数制。二进制数据是用0和1两个数码来表示的数。它的基数为2，进位规则是“逢二进一”，借位规则是“借一当二”。 比如我们一般采用的都是十进制表示，比如9再继续加1的话，就需要进位了，变成10，在二进制中，因为只有0和1，所以当1继续加1时，就需要进位了，就变成10了（注意这不是十，读成一零就行了） 当然，仅仅有两种信号还不够，我们还需要逻辑门来辅助我们完成更多的计算，最基本的逻辑关系是与、或、非，而逻辑门就有相应的是与门、或门和非门，可以用电阻、电容、二极管、三极管等分立原件构成（具体咋构成的咱这里就不说了） 比如与操作，因为只有两种类型，我们一般将1表示为真，0表示为假，与操作（用&amp;表示）要求两个数参与进来，比如： 1 &amp; 1 = 1 必须两边都是真，结果才为真。 1 &amp; 0 = 0 两边任意一个或者都不是真，结果为假。 或运算（用 | 表示）： 1 | 0 = 1 两边只要有一个为真，结果就为真 0 | 0 = 0 两边同时为假，结果才是假 非运算实际上就是取反操作（可以是 ! 表示） !1 = 0 !0 = 1 非运算会将真变成假，假变成真 有了这些运算之后，我们的电路不仅仅可以实现计算，也可以实现各种各样的逻辑判断，最终才能发展成我们的计算机。 前面我们大概介绍一下计算机的底层操作原理，接着我们来看看计算机的基本组成。 相信各位熟知的计算机都是一个屏幕+一个主机的形式，然后配上我们的键盘鼠标，就可以开始使用了，但是实际上标准的计算机结构并没有这么简单，我们来看看： 我们电脑最核心的部件，当属CPU，因为几乎所有的运算都是依靠CPU进行（各种各样的计算电路已经在CPU中安排好了，我们只需要发送对应的指令就可以进行对应的运算），它就像我们人的大脑一样，有了大脑才能进行思考。不过光有大脑还不行，还要有一些其他的部分来辅助工作，比如我们想向电脑里面打字，那么就需要连接一个键盘才能输入，我们想要点击桌面上的图标，那么就需要一个鼠标来操作光标，这些都是输入设备。我们的电脑开机之后显示器上会显示出画面，实际上显示器就是输出设备。 当然除了这些内容之外，我们的电脑还需要内存来保存运行时的一些数据，以及外存来保存文件（比如硬盘）等。我们常说的iPhone13 512G，这个512G并不是指的内存，而是指的外存，准确的说是用于存放文件硬盘大小，而真正的内存是我们常说的4G/6G/8G运行内存，内存的速度远高于外存的速度，所以1G内存的价格远超1G硬盘的价格。 计算机包括五大部件：运算器、控制器、存储器、输入和输出设备。有了这一套完整的硬件环境，我们的电脑才算是有了一个完整的身体。 问题：我们上面提到的这些硬件设备哪些是属于外设？ 操作系统概述前面我们了解了一下计算机的大致原理和组成结构，但是光有这一套硬件可不行，如何让这一套硬件按照我们想要的方式运作起来，也是非常重要的，这时我们就需要介绍操作系统了。 操作系统（operating system，简称OS）是管理计算机硬件与软件资源的计算机程序。操作系统需要处理如管理与配置内存、决定系统资源供需的优先次序、控制输入设备与输出设备、操作网络与管理文件系统等基本事务。操作系统也提供一个让用户与系统交互操作的界面。 一般在计算机专业大二，会开放《操作系统》课程，会详细讲解操作系统的底层运作机制和调度。 一般我们电脑上都安装了Windows操作系统（苹果笔记本安装的是MacOS操作系统），现在主流的电脑都已经预装Windows11了： 有了操作系统，我们的电脑才能真正运行起来，我们就可以轻松地通过键盘和鼠标来操作电脑了。 不过操作系统最开始并不是图形化界面，它类似于Windows中的命令提示符： 没有什么图标这些概念，只有一个简简单单的黑框让我们进行操作，通过输入命令来进行一些简单的使用，程序的运行结果也会在黑框框（命令行）中打印出来，不过虽然仅仅是一个黑框，但是能运行的程序可是非常非常多的，只需要运行我们编写好的程序，就能完成各种各样复杂的计算任务，并且计算机的计算速度远超我们的人脑。 中国超级计算机系统天河二号，计算速度达到每秒5.49亿亿次。 当然，除了我们常见的Windows和MacOS系统之外，还有我们以后需要经常打交道的Linux操作系统，这种操作系统是开源的，意思是所有的人都可以拿到源代码进行修改，于是就出现了很多发行版： 这些发行版有带图形化界面的，也有不带图形化界面的，不带图形化界面的Linux将是我们以后学习的重点。 不同操作系统之间的软件并不是通用的，比如Windows下我们的软件一般是.exe后缀名称，而MacOS下则不是，并且也无法直接运行.exe文件，这是因为不同操作系统的具体实现会存在一些不同，程序编译（我们之后会介绍到）之后的格式也会不同，所以是无法做到软件通用的。 正是因为有了操作系统，才能够组织我们计算机的底层硬件（包括CPU、内存、输入输出设备等）进行有序工作，没有操作系统电脑就如同一堆废铁，只有躯壳没有灵魂。 计算机编程语言现在我们大致了解了我们的电脑的运作原理，实际上是一套完整的硬件+一个成形的操作系统共同存在的。接着我们就可以开始了解一下计算机的编程语言了。我们前面介绍的操作系统也是由编程语言写出来的，操作系统本身也算是一个软件。 那么操作系统是如何让底层硬件进行工作的呢？实际上就是通过向CPU发送指令来完成的。 计算机指令就是指挥机器工作的指示和命令，程序就是一系列按一定顺序排列的指令，执行程序的过程就是计算机的工作过程。指令集，就是CPU中用来计算和控制计算机系统的一套指令的集合，而每一种新型的CPU在设计时就规定了一系列与其他硬件电路相配合的指令系统。而指令集的先进与否，也关系到CPU的性能发挥，它也是CPU性能体现的一个重要标志。 我们电脑中的CPU有多种多样的，不同的CPU之间可能也会存在不同的架构，比如现在最常用的是x86架构，还有我们手机平板这样的移动设备使用的arm架构，不同的架构指令集也会有不同。 我们知道，计算机底层硬件都是采用的0和1这样的二进制表示，所以指令也是一样的，比如（这里随便写的）： 000001 - 代表开机 000010 - 代表关机 000011 - 代表进行加法运算 当我们通过电路发送给CPU这样的二进制指令，CPU就能够根据我们的指令执行对应的任务，而我们编写的程序保存在硬盘中也是这样的二进制形式，我们只需要将这些指令组织好，按照我们的思路一条一条执行对应的命令，就能够让计算机计算任何我们需要的内容了，这其实就是机器语言。 不过随着时代的进步，指令集越来越大，CPU支持的运算类型也越来越多，这样的纯二进制编写实在是太累了，并且越来越多的命令我们根本记不住，于是就有了汇编语言。汇编语言将这些二进制的操作码通过助记符来替换： MOV 传送字或字节。 MOVSX 先符号扩展,再传送。 MOVZX 先零扩展,再传送。 PUSH 把字压入堆栈。 把这些原有的二进制命令通过一个单词来代替，这样是不是就好记多了，在程序编写完成后，我们只需要最后将这些单词转换回二进制指令就可以了，这也是早期出现的低级编程语言。 不过虽然通过这些助记符就能够很轻松地记住命令，但是还是不够方便，因为可能我们的程序需要完成一个很庞大的任务，但是如果还是这样一条一条指令进行编写，是不是太慢了点，有时候可能做一个简单的计算，都需要好几条指令来完成。于是，高级编程语言——C语言，终于诞生了。 C语言诞生于美国的贝尔实验室，由丹尼斯·里奇（Dennis MacAlistair Ritchie）以肯尼斯·蓝·汤普森（Kenneth Lane Thompson）设计的B语言为基础发展而来，在它的主体设计完成后，汤普森和里奇用它完全重写了UNIX操作系统，且随着UNIX操作系统的发展，C语言也得到了不断的完善。 高级语言不同于低级语言，低级语言的主要操作对象是指令本身，而高级语言却更加符合我们人脑的认知，更像是通过我们人的思维，去告诉计算机你需要做什么，包括语法也会更加的简单易懂。下面是一段简单的C语言代码： 123456int main() &#123; int a = 10; //定义一个a等于10 int b = 10; //定义一个b等于10 int c = a + b; //语义非常明确，c就是a加上b计算出来的结果。 return 0;&#125; 不过现在看不懂没关系，我们后面慢慢学。 C语言虽然支持按照我们更容易理解的方式去进行编程，但是最后还是会编译成汇编指令最后变成计算机可以直接执行的指令，不过具体的编译过程，我们不需要再关心了，我们只需要去写就可以了，而对我们代码进行编译的东西，称为编译器。 当然，除了C语言之外，还有很多其他的高级语言，比如Java、Python、C#、PHP等等，相比其他编程语言，C算是比较古老的一种了，但是时隔多年直至今日，其他编程语言也依然无法撼动它的王者地位： 可以看到在2021年9月，依然排在编程语言排行榜的第一名（Python和Java紧随其后），可见这门语言是多么的不可撼动，很多操作系统、高级编程语言底层实现，几乎都是依靠C语言去编写的（包括Java的底层也是C/C++实现的）所以学习这一门语言，对于理工科尤其是计算机专业极为重要，学好C语言你甚至可以融汇贯通到其他语言，学起来也会轻松很多。 那么从下节课开始，我们就先做好一些环境上的准备。 C语言开发环境部署完成开发环境部署之后，我们就可以使用C语言来将一句话输出到控制台了，成功编译运行下面的简单程序： 123456#include &lt;stdio.h&gt;int main() &#123; printf(&quot;Hello, World!\\n&quot;); return 0;&#125; 首先，我们既然要将我们编写的C语言代码进行编译，那么肯定得找到一个合适的编译器才行，现代的集成开发环境IDE一般都包含了这些编译器，所以我们不需要进行单独的安装。 我们只需要找一个集成开发环境去安装就行了，目前功能比较完善的集成开发环境有： Codeblocks（支持Windows、Linux、MacOS操作系统） Visual Studio（支持Windows、MacOS操作系统） CLion（支持Windows、Linux、MacOS操作系统） 这里我们就使用CLion作为我们的开发工具使用（这个IDE是收费的，但是学生可以申请免费使用，别担心，大学四年肯定是够你用了，选这个是考虑到后面同学们可能会继续学习Java，Java语言的推荐IDE也是同一个公司的产品，界面都长得差不多）当然如果你想要使用其他的开发工具，也可以，但是这里我们就不演示了。 首先前往官网下载：CLion: A Cross-Platform IDE for C and C++ by JetBrains 下载完成后我们直接点击安装： 如果你不是很熟悉，建议直接点Next安装到C盘默认路径，不要去修改，当然如果确实C盘没有空间，那可以自行修改为其他路径，但是注意最好路径中不要出现中文。 勾选一下创建快捷方式，然后继续点Next等待安装就行了： 安装完成后，我们可以直接打开： 这里会提示我们激活，点击按钮去官网注册一个账号。注册完成后，推荐去申请一下学生授权，因为试用只有30天：Jetbrains学生授权获取指南 - 知乎 (zhihu.com) 这里我们点击开始试用，然后就可以点击Continue了，现在成功来到主界面： 由于是英文，使用不太方便，所以我们安装一下中文插件： 现在我们就成功安装好CLion集成开发环境了。 现在我们来创建我们的第一个C语言项目（我们的程序是以一个项目的形式进行管理的，这里知道怎么创建就行了）： 这里选择C可执行文件，然后项目的保存位置可以自行修改，配置完成后点击创建： 可以看到，在创建之后，会自动为我们生成一段示例代码，而之后我们要编写的代码，都在生成的main.c中进行编写，除了这个文件，其他的全部不要去修改，也不用管是什么意思，后面我们会慢慢介绍。 接着我们需要配置一下工具链，选择捆绑的MinGW（如果已经有了就不需要配置了） 那么这段示例代码有了，我们如何编译运行呢？ 我们可以点击代码旁边的绿色三角形符号或是右上角的绿色三角形，就可以直接编译运行我们的代码了。运行的结果是在控制台输出一个“HelloWorld！”，当然我们也可以直接运行编译出来的可执行文件： 我们可以看到，这里生成了一个项目名称.exe文件，这种就是Windows环境下可以直接运行的应用程序，我们可以打开这个文件夹，直接使用cmd来运行： 运行出来的效果是一样的，这种程序实际上就是最原始的命令行程序，输入和输出都是在这种黑框框中进行的，而我们的主要学习目标也是这种命令行程序。 这样我们就配置好了开发环境，然后就不要去动其他的东西了，一般新手最容易遇到一些奇奇怪怪的问题。","categories":[{"name":"后端","slug":"后端","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"后端/C-C","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/"},{"name":"开发环境搭建","slug":"后端/C-C/开发环境搭建","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/%E5%BC%80%E5%8F%91%E7%8E%AF%E5%A2%83%E6%90%AD%E5%BB%BA/"}],"tags":[{"name":"后端","slug":"后端","permalink":"http://example.com/tags/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"C-C","permalink":"http://example.com/tags/C-C/"},{"name":"操作系统","slug":"操作系统","permalink":"http://example.com/tags/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"name":"计算机","slug":"计算机","permalink":"http://example.com/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA/"}]},{"title":"Markdwon 语法速查","slug":"语法速查","date":"2022-12-12T07:27:50.000Z","updated":"2022-12-12T08:35:38.154Z","comments":true,"path":"2022/12/12/语法速查/","link":"","permalink":"http://example.com/2022/12/12/%E8%AF%AD%E6%B3%95%E9%80%9F%E6%9F%A5/","excerpt":"本来想写个表格嘞，结果这破Markdown把我演示语法都给实现了，只能截图了…","text":"本来想写个表格嘞，结果这破Markdown把我演示语法都给实现了，只能截图了… 基础语法 扩展语法","categories":[{"name":"速查集","slug":"速查集","permalink":"http://example.com/categories/%E9%80%9F%E6%9F%A5%E9%9B%86/"}],"tags":[{"name":"Markdown","slug":"Markdown","permalink":"http://example.com/tags/Markdown/"},{"name":"技巧","slug":"技巧","permalink":"http://example.com/tags/%E6%8A%80%E5%B7%A7/"}]},{"title":"Python+Tesseract实现图片文字识别","slug":"Python-Tesseract实现图片文字识别","date":"2022-12-12T02:44:03.000Z","updated":"2022-12-12T23:51:18.879Z","comments":true,"path":"2022/12/12/Python-Tesseract实现图片文字识别/","link":"","permalink":"http://example.com/2022/12/12/Python-Tesseract%E5%AE%9E%E7%8E%B0%E5%9B%BE%E7%89%87%E6%96%87%E5%AD%97%E8%AF%86%E5%88%AB/","excerpt":"什么是OCR？OCR，全称Optical Character Recognition ，中文释义为光学字符识别，是指对一个包含文本信息的图片文件的识别，目前比较流行的OCR有tesseractOCR和cnOCR,在这篇文章中我们使用识别效果较好的tesseractOCR。","text":"什么是OCR？OCR，全称Optical Character Recognition ，中文释义为光学字符识别，是指对一个包含文本信息的图片文件的识别，目前比较流行的OCR有tesseractOCR和cnOCR,在这篇文章中我们使用识别效果较好的tesseractOCR。 安装Tesseract-OCR和pytesseract首先我们要安装tesseract，这两个网址任选其一即可： Home · UB-Mannheim/tesseract Wiki (github.com) Index of /tesseract解释一下这些名称的含义，我们以最新版本v5.20举例：w64的w是指Windows系统，64则是指电脑CPU采用64位处理技术，setup就是安装包，后面的版本号很好理解了。但是如果版本号后面跟上alpha，dev的话就是指这个安装包为开发版或是预览版，大多数程序的开发板大多不稳定，所以这里我们就是用最新的v5.2.0稳定版安装包。 点击下载，下载完成后运行安装程序：选择语言，没有中文，只好选英文。 然后一直next，但是注意！在选择安装语言时这个Additional lauguage data千万不要全选，要不然下载过程特别慢，如果需要的话，只安装里面的 Chinese与English组件就行了。 接下来就比较简单了，直接next，等待安装完成即可。 安装完成后我们还得添加环境变量，打开自己安装tesseract的文件夹，复制路径： 回到桌面，右键此电脑：选择属性，点击高级系统设置，环境变量： 打开环境变量，双击用户变量的Path，新建变量： 把复制的路径粘贴进去，点确定，我们的环境配置就完成了。 验证安装win+r，输入cmd，输入 tesseract -v 再回车，如果出现了tesseract的版本信息就说明配置成功了。 为了在python中使用tesseract，我们需要安装pytesseract，直接在cmd中用pip安装就好了： 1pip install pytesseract （无视里面的黄色字体，是我电脑的问题，对安装什么的没有影响） 实现自动识别文字打开python编辑器，把这段代码复制进去： 1234567import pytesseractfrom PIL import Imagepytesseract.pytesseract.tesseract_cmd = &#x27;D://Tesseract-OCR//tesseract.exe&#x27; # 替换成你自己的tesseract安装路径text = pytesseract.image_to_string(Image.open(&#x27;D://input.png&#x27;)) # 替换成要识别的图片路径print(text) 用windows自带画图随便做个图： 运行输出为 Hello world ，完美。 怎么样，好玩吧？不仅这样，tesseract还可以识别中文！只不过得安装相应的库，这是下载链接： https://github.com/tesseract-ocr/tessdata/blob/main/chi_sim.traineddata下载下来中文训练包后，把包放到tessdata中就可以识别中文了。","categories":[{"name":"后端","slug":"后端","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/"},{"name":"Python","slug":"后端/Python","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/Python/"}],"tags":[{"name":"Python","slug":"Python","permalink":"http://example.com/tags/Python/"},{"name":"人工智能","slug":"人工智能","permalink":"http://example.com/tags/%E4%BA%BA%E5%B7%A5%E6%99%BA%E8%83%BD/"},{"name":"后端","slug":"后端","permalink":"http://example.com/tags/%E5%90%8E%E7%AB%AF/"}]},{"title":"2分钟速看Cookie","slug":"2分钟速看Cookie","date":"2022-12-11T14:02:46.000Z","updated":"2022-12-12T07:27:03.412Z","comments":true,"path":"2022/12/11/2分钟速看Cookie/","link":"","permalink":"http://example.com/2022/12/11/2%E5%88%86%E9%92%9F%E9%80%9F%E7%9C%8BCookie/","excerpt":"Cookie是什么？Cookie , 在百度百科中的介绍是指”储存在用户本地终端上的数据”,用人话来说就类似于浏览器在本地的缓存，它是网站用来识别用户的一个文本。一般来说，在我们打开网站时，网站的Web服务器会为用户生成一个ID信息，可以说这就是用户的网络”身份证“，然后这个”身份证“就会保存到用户的电脑本地，以后如果用户再次登入这个网站，Web服务器就可以读取这个文本，就可以获取用户的各个信息了，这个过程也就是登录。","text":"Cookie是什么？Cookie , 在百度百科中的介绍是指”储存在用户本地终端上的数据”,用人话来说就类似于浏览器在本地的缓存，它是网站用来识别用户的一个文本。一般来说，在我们打开网站时，网站的Web服务器会为用户生成一个ID信息，可以说这就是用户的网络”身份证“，然后这个”身份证“就会保存到用户的电脑本地，以后如果用户再次登入这个网站，Web服务器就可以读取这个文本，就可以获取用户的各个信息了，这个过程也就是登录。 Cookie的发送机制总体来说，每当我们第一次登录一个网站时，Web服务器就会发送一个Cookie到用户本地，在以后的登录中，用户本地的Cookie就会发送到Web服务器，从而验证自己的账户，用一张图来表示： Cookie的组成Cookie本质上还是一个文本数据，一般这个数据是经过加密的，由名称，值，还有几个用于控制Cookie使用范围或有效时间等量组成。 名称和值 Name/Value：Cookie的名称以及值。 有效期 Expires：Cookie的有效期。Expriers分为两种存储方式：会话性与持久性。会话性Cookie，保存在用户的内存中，会在推出浏览器时清空；而持久性Cookie会保存在用户的本地硬盘中，直至用户退出登录时才会失效 。说人话就是一个临时存储，一个长久存储。 使用范围 Domain：Cookie的使用于访问范围。 安全性 Secure：Cookie是否使用Https协议。 总结Cookie是网站用于识别用户身份，保存在用户本地上的数据（经过加密），由用户本地暂时或长久保存的文本数据，一般由名称，值，有效期，使用范围等组成。","categories":[{"name":"前端","slug":"前端","permalink":"http://example.com/categories/%E5%89%8D%E7%AB%AF/"},{"name":"Web","slug":"前端/Web","permalink":"http://example.com/categories/%E5%89%8D%E7%AB%AF/Web/"}],"tags":[{"name":"Web","slug":"Web","permalink":"http://example.com/tags/Web/"},{"name":"前端","slug":"前端","permalink":"http://example.com/tags/%E5%89%8D%E7%AB%AF/"},{"name":"小知识","slug":"小知识","permalink":"http://example.com/tags/%E5%B0%8F%E7%9F%A5%E8%AF%86/"}]},{"title":"上千字干货带你深入了解C/C++动态规划","slug":"上千字干货带你深入了解C-C-动态规划","date":"2022-12-11T13:58:52.000Z","updated":"2022-12-12T23:53:27.005Z","comments":true,"path":"2022/12/11/上千字干货带你深入了解C-C-动态规划/","link":"","permalink":"http://example.com/2022/12/11/%E4%B8%8A%E5%8D%83%E5%AD%97%E5%B9%B2%E8%B4%A7%E5%B8%A6%E4%BD%A0%E6%B7%B1%E5%85%A5%E4%BA%86%E8%A7%A3C-C-%E5%8A%A8%E6%80%81%E8%A7%84%E5%88%92/","excerpt":"提醒：本文需读者具有以下C/C++基础： 循环结构，数组 函数 递归","text":"提醒：本文需读者具有以下C/C++基础： 循环结构，数组 函数 递归 动态规划的定义 动态规划（Dynamic Programming，简称DP），是一种通过把复杂问题分解为相对简单的子问题的方式求解最优策略的方法，可以有效的解决背包问题、资源分配问题、最短路径问题和复杂系统可靠性问题等求最优解策略问题。dynamic programming is a method for solving a complex problem by breaking it down into a collection of simpler subproblems. ——Wikipedia译文：一般这些子问题很相似，可以通过函数关系式递推出来。然后呢，动态规划就致力于解决每个子问题一次，减少重复计算,比如斐波那契数列就可以看做入门级的经典动态规划问题。 ——维基百科 说实话，我看我也头痛，拿来装杯不错，真理解还得靠自己啊！我给大家翻译翻译什么叫动态规划：动态规划，别看名字很高深，其实本质就是将复杂的问题化为简单的子问题，再将子问题化为更为简单的子问题，直至简单到不能再简单，一下就能给出答案的程度。就酱，很复杂的题就迎刃而解了。还有动态规划Plus版，就是将每一次子问题的答案保存下来，这样以后要用到时直接调用就行了，效率更上十层楼。也就是记忆化搜索。 什么？还不能理解？那就看这几个小剧场： A：1+2+3+4+5+6+7=28，那么1+2+3+4+5+6+7+8等于几？B：36。A：你是怎么算出来的？B：1+2+3+4+5+6+7=28，那么1+2+3+4+5+6+7+8=28+8=36. 这就是记忆化搜索。 核心思想我个人将其总结为一型三征，一型就是动态规划适合解决的问题的模型， 三征也就是三个特征：最优子结构，无后效性，记忆化搜索。 由于过于抽象，以下内容不要求全部背下，但一定要能够说出这三个性质中粗体部分。1.最优子结构如果问题的最优解所包含的子问题的解也是最优的，我们就称该问题具有最优子结构性质（即满足最优化原理）。最优子结构性质为动态规划算法解决问题提供了重要线索。2.无后效性即子问题的解一旦确定，就不再改变，不受在这之后、包含它的更大的问题的求解决策影响。3.记忆化搜索也称子问题重叠性质，子问题重叠性质是指在用递归算法自顶向下对问题进行求解时，每次产生的子问题并不总是新问题，有些子问题会被重复计算多次。动态规划算法正是利用了这种子问题的重叠性质，每次计算完一次子问题的答案，再将答案保存下来，在遇到重复的自问题时直接调用之前保存的答案，从而获得更高的效率。 解题步骤综上所述，那么基本的动态规划题目的解题步骤大体就是酱：1. 寻找最优子结构(状态表示)2. 写出状态转移方程(状态计算)3. 边界初始化 光说不练是假把式，我们先来看一道力扣极为经典的题目——斐波那契数列。 509.斐波那契数列 某网友：啊，这个我熟！肥波纳粹数列！我：emm….. 滚去练打字！ 本题链接： 509. 斐波那契数 - 力扣（LeetCode） 题目描述 斐波那契数 （通常用 F(n) 表示）形成的序列称为 斐波那契数列 。该数列由 0 和 1 开始，后面的每一项数字都是前面两项数字的和。也就是： 12F(0) = 0，F(1) = 1F(n) = F(n - 1) + F(n - 2)，其中 n &gt; 1 给定 n ，请计算 F(n) 。 哎呀，这时候可能有人要说了： 欸嘿嘿，这不简单，直接一个递归不就行了吗 于是他兴冲冲地写完代码： 1234567class Solution &#123;public: int fib(int n) &#123; if(n==0||n==1) return n; return fib(n-1)+fib(n-2); &#125;&#125;; 复制粘贴提交： 可以看到勉强虽然但是差不多通过了，但用时极其夸张，那这是为什么呢？别急，我们先来分析一下这个代码的运算过程。 代码分析我们设 n=5 时，来看一下程序的运算过程： 欸，你发现了什么？ fib (3)在计算过程中计算了两次 没错，上图中圈画的fib (3)在计算过程中计算了两次，而当我们把 n 设的更大，比如说 n=7。 会发现重复计算已经不是一次两次了，甚至是整个分支都存在重复。而计算越庞大，比如 n=1000,10000，重复计算也就越多，时间复杂度就十分恐怖了， 要不是力扣大大好，题目中设定了 0&lt;=n&lt;=30，也就是不可能超过30，这样做法肯定会超时。既然存在这么大的问题，那要怎么优化呢？ 优化方案没错，记忆化搜索，我们在前面讲过了，当子问题存在大量重复计算时，利用子问题重叠性质，就可以将子问题的答案记录下来，在需要用到时就直接调用，一劳永逸，很轻松就解决了重复计算的问题。 123456789101112131415class Solution &#123;public: int fib(int n) &#123; if (n &lt; 2) &#123; return n; &#125; int p = 0, q = 0, r = 1; for (int i = 2; i &lt;= n; ++i) &#123; p = q; q = r; r = p + q; &#125; return r; &#125;&#125;; 提交上去： 效率完爆递归算法。 练习题单做完这道题，是不是觉得自己又”行”了？ 那我可得好好挫挫你的锐气，动态规划难题多的是！来，收下这份大礼包（难度依次增加）： 70. 爬楼梯 - 力扣（LeetCode） 746. 使用最小花费爬楼梯 - 力扣（LeetCode） Loading Question… - 力扣（LeetCode） 5. 最长回文子串 - 力扣（LeetCode） 53. 最大子数组和 - 力扣（LeetCode） 95. 不同的二叉搜索树 II - 力扣（LeetCode） 213. 打家劫舍 II - 力扣（LeetCode） 32. 最长有效括号 - 力扣（LeetCode） 123. 买卖股票的最佳时机 III - 力扣（LeetCode） 689. 三个无重叠子数组的最大和 - 力扣（LeetCode） ——————本文完结撒花——————","categories":[{"name":"后端","slug":"后端","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"后端/C-C","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/"},{"name":"算法","slug":"后端/C-C/算法","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/%E7%AE%97%E6%B3%95/"}],"tags":[{"name":"后端","slug":"后端","permalink":"http://example.com/tags/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"C-C","permalink":"http://example.com/tags/C-C/"},{"name":"算法","slug":"算法","permalink":"http://example.com/tags/%E7%AE%97%E6%B3%95/"},{"name":"动态规划","slug":"动态规划","permalink":"http://example.com/tags/%E5%8A%A8%E6%80%81%E8%A7%84%E5%88%92/"}]}],"categories":[{"name":"后端","slug":"后端","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"后端/C-C","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/"},{"name":"开发环境搭建","slug":"后端/C-C/开发环境搭建","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/%E5%BC%80%E5%8F%91%E7%8E%AF%E5%A2%83%E6%90%AD%E5%BB%BA/"},{"name":"速查集","slug":"速查集","permalink":"http://example.com/categories/%E9%80%9F%E6%9F%A5%E9%9B%86/"},{"name":"Python","slug":"后端/Python","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/Python/"},{"name":"前端","slug":"前端","permalink":"http://example.com/categories/%E5%89%8D%E7%AB%AF/"},{"name":"Web","slug":"前端/Web","permalink":"http://example.com/categories/%E5%89%8D%E7%AB%AF/Web/"},{"name":"算法","slug":"后端/C-C/算法","permalink":"http://example.com/categories/%E5%90%8E%E7%AB%AF/C-C/%E7%AE%97%E6%B3%95/"}],"tags":[{"name":"后端","slug":"后端","permalink":"http://example.com/tags/%E5%90%8E%E7%AB%AF/"},{"name":"C/C++","slug":"C-C","permalink":"http://example.com/tags/C-C/"},{"name":"操作系统","slug":"操作系统","permalink":"http://example.com/tags/%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F/"},{"name":"计算机","slug":"计算机","permalink":"http://example.com/tags/%E8%AE%A1%E7%AE%97%E6%9C%BA/"},{"name":"Markdown","slug":"Markdown","permalink":"http://example.com/tags/Markdown/"},{"name":"技巧","slug":"技巧","permalink":"http://example.com/tags/%E6%8A%80%E5%B7%A7/"},{"name":"Python","slug":"Python","permalink":"http://example.com/tags/Python/"},{"name":"人工智能","slug":"人工智能","permalink":"http://example.com/tags/%E4%BA%BA%E5%B7%A5%E6%99%BA%E8%83%BD/"},{"name":"Web","slug":"Web","permalink":"http://example.com/tags/Web/"},{"name":"前端","slug":"前端","permalink":"http://example.com/tags/%E5%89%8D%E7%AB%AF/"},{"name":"小知识","slug":"小知识","permalink":"http://example.com/tags/%E5%B0%8F%E7%9F%A5%E8%AF%86/"},{"name":"算法","slug":"算法","permalink":"http://example.com/tags/%E7%AE%97%E6%B3%95/"},{"name":"动态规划","slug":"动态规划","permalink":"http://example.com/tags/%E5%8A%A8%E6%80%81%E8%A7%84%E5%88%92/"}]}